<a href="https://colab.research.google.com/github/vini-fritzen/Machine-Learning/blob/main/Aula1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
### Importação da Libs
import pandas as pd
import numpy as np

In [14]:
titanic_df = pd.read_csv("./Data/titanic.csv")

In [15]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
titanic_df_2 = titanic_df[['Sex', 'Fare', 'Age']]

In [26]:
titanic_df_2['Sex'] = titanic_df_2['Sex'].replace('male', 1)
titanic_df_2['Sex'] = titanic_df_2['Sex'].replace('female', 0)

C:\Users\vini_\AppData\Local\Temp\ipykernel_15332\196661055.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic_df_2['Sex'] = titanic_df_2['Sex'].replace('male', 1)
C:\Users\vini_\AppData\Local\Temp\ipykernel_15332\196661055.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  titanic_df_2['Sex'] = titanic_df_2['Sex'].replace('female', 0)
C:\Users\vini_\AppData\Local\Temp\ipykernel_15332\196661055.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic_df_2['Sex'] = titanic_df_2['Sex'].replace('female', 0)

In [28]:
titanic_df_2['Age'].isna().sum()

177

In [29]:
titanic_df_2['Age'] = titanic_df_2['Age'].fillna(titanic_df_2['Age'].mean())

C:\Users\vini_\AppData\Local\Temp\ipykernel_15332\2164014418.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic_df_2['Age'] = titanic_df_2['Age'].fillna(titanic_df_2['Age'].mean())

In [33]:
titanic_df_2

     Sex     Fare        Age
0      1   7.2500  22.000000
1      0  71.2833  38.000000
2      0   7.9250  26.000000
3      0  53.1000  35.000000
4      1   8.0500  35.000000
..   ...      ...        ...
886    1  13.0000  27.000000
887    0  30.0000  19.000000
888    0  23.4500  29.699118
889    1  30.0000  26.000000
890    1   7.7500  32.000000

[891 rows x 3 columns]

In [32]:
titanic_df_3 = titanic_df[['Survived']]
titanic_df_3

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]